void main(List<String> args) {
  //ساخت رشته با الحاق مستقیم با استفاده از عملگر جمع
  //هر بار که دو رشته را با عملگر جمع به هم می‌چسبانیم یک رشته جدید در حافظه ساخته می‌شود
  //برای تعداد کم مشکلی ندارد ولی در حلقه‌ها و تعداد زیاد کارایی پایینی دارد
  // استفاده از عملگر + هنگام ساختن رشته‌های طولانی تکه‌تکه کارآمد نیست. دلیل آن این است که رشته‌های دارت تغییرناپذیر هستند
  //به این معنا که نمی‌توان آن‌ها را تغییر داد
  //بنابراین هر بار که دو رشته را به هم اضافه می‌کنید
  //دارت باید یک شیء جدید برای رشته‌ی ترکیب‌شده ایجاد کند
  var message = 'hello' + ' my name is ';
  const name = 'towhid';
  message += name;
  print(message);
  // خروجی:
  // hello my name is towhid

  // ساخت رشته با روش بهینه و حرفه‌ای
  // این روش بجای ساختن رشته جدید در هر مرحله، قطعات را در یک حافظه موقت جمع می‌کند
  // و فقط در پایان یک رشته نهایی تولید می‌کند
  // برای ساخت رشته‌های طولانی یا درون حلقه‌ها این روش بسیار سریع‌تر و بهینه‌تر است
  //یک روش مؤثرتر برای ساخت رشته‌ها استفاده از کلاس StringBuffer است.
  // واژه «بافر» به ناحیه‌ای از حافظه کامپیوتر اشاره دارد که می‌توانید آن را تغییر دهید.
  // StringBuffer به شما اجازه می‌دهد تا رشته‌ها را به بافر داخلی اضافه کنید بدون اینکه هر بار نیاز به ایجاد یک شیء جدید داشته باشید. وقتی ساخت رشته را تمام کردید،
  // کافیست محتویات StringBuffer را به String تبدیل کنید.

  final message2 = StringBuffer();
  message2.write('hello ');
  message2.write('my name is ');
  message2.write(name);
  print(message2.toString()); //فراخوانی toString بافر رشته را به نوع String تبدیل می‌کند. این شبیه تبدیل نوعی است که وقتی toInt را برای تبدیل یک عدد اعشاری به نوع int فراخوانی می‌کنید دیده‌اید
  // خروجی:
  // hello my name is towhid

  // چاپ توان‌های عدد ۲ در هر تکرار حلقه
  // مقدار اولیه ۲ است و هر بار در ۲ ضرب می‌شود تا به ۱۰۲۴ برسد
  // مشکل: هر بار یک خط جداگانه چاپ می‌شود
  for (var i = 2; i < 1024; i *= 2) {
    print(i);
  }
  // خروجی: هر عدد در یک خط جداگانه
  // 2
  // 4
  // 8
  // 16
  // 32
  // 64
  // 128
  // 256
  // 512

  // راه‌حل بهتر: جمع‌آوری تمام اعداد در یک حافظه موقت و چاپ یکجا
  // اینجا مزیت اصلی حافظه موقت مشخص می‌شود
  // بجای ساختن رشته جدید در هر تکرار حلقه، قطعات را جمع می‌کنیم
  // و فقط یک بار در انتها نتیجه نهایی را چاپ می‌کنیم
  final buffer = StringBuffer();
  for (var i = 2; i < 1024; i *= 2) {
    buffer.write(i);
    buffer.write(' ');
  }
  print(buffer);
  // خروجی در یک خط:
  // 2 4 8 16 32 64 128 256 512
  //در هر حلقه، شماره را در بافر می‌نویسید و یک فاصله اضافه می‌کنید. در این مورد نیازی به فراخوانی buffer.toString() نیست
  // زیرا دستور چاپ به صورت داخلی این کار را مدیریت می‌کند.
  //در اینجا چند موقعیت دیگر وجود دارد که یک بافر رشته‌ای مفید خواهد بود: گوش دادن به جریان داده‌ای که از شبکه می‌آید. پردازش یک فایل متنی یک خط در هر بار.
}
