void main(List<String> args) {
  //اعتبارسنجی رشته
  //شما هرگز نباید به ورودی کاربران اعتماد کنید. مشکل این نیست که همه هکر هستند و می‌خواهند وارد سیستم شما شوند
  //بلکه بیشتر اوقات، کاربران بی‌گناه اشتباهات تایپی ساده‌ای انجام می‌دهند
  //وظیفه شما این است که مطمئن شوید فقط داده‌هایی را اجازه می‌دهید که در قالب درست باشند
  //تأیید اینکه ورودی متنی کاربر در فرم مناسب است، اعتبارسنجی رشته نامیده می‌شود

  //لیست برخی از رایج‌ترین داده‌هایی که باید اعتبارسنجی شوند:
  //شماره تلفن‌ها
  //شماره کارت‌های اعتباری
  //آدرس‌های ایمیل
  //گذرواژه‌ها

  //کلاس String شامل چندین متد است که به شما کمک می‌کند محتوای یک رشته را اعتبارسنجی کنید.

  const text = 'I love Dart';
  print(text.startsWith('I')); // true
  print(text.endsWith('Dart')); // true

  //و اگر می‌خواهید وسط یک رشته را بررسی کنید، از contains استفاده کنید
  print(text.contains('love'));
  // true
  print(text.contains('Flutter')); //

  //تمام این مثال‌ها بسیار خوب هستند،
  //چگونه می‌توانید بررسی کنید که یک شماره تلفن فقط شامل اعداد است یا یک گذرواژه شامل حروف بزرگ و کوچک، اعداد و کاراکترهای ویژه است؟
  //این اتفاق توسط عبارات منظم میفتاد که در فایل مربوط به عبارت منظزم ان ها را بررسی میکنیم
}
