void main(List<String> args) {
  // اعتبارسنجی رشته:
  // شما هرگز نباید به ورودی کاربران اعتماد کنید.
  // مشکل این نیست که همه هکر هستند و می‌خواهند وارد سیستم شما شوند،
  // بلکه بیشتر اوقات، کاربران عادی اشتباهات تایپی ساده‌ای انجام می‌دهند.
  // وظیفه شما این است که مطمئن شوید
  // فقط داده‌هایی را اجازه می‌دهید که در قالب درست باشند.
  // تأیید اینکه ورودی متنی کاربر در فرم مناسب است،
  // اعتبارسنجی رشته یا:
  // string validation
  // نامیده می‌شود.

  // برخی از رایج‌ترین داده‌هایی که باید اعتبارسنجی شوند:
  // ۱. شماره تلفن‌ها
  // ۲. شماره کارت‌های اعتباری
  // ۳. آدرس‌های ایمیل
  // ۴. گذرواژه‌ها

  // کلاس:
  // String
  // شامل چندین متد است که به شما کمک می‌کند
  // محتوای یک رشته را اعتبارسنجی کنید:

  const text = 'I love Dart';

  // startsWith()
  // بررسی شروع رشته با یک مقدار مشخص:
  print(text.startsWith('I'));
  // خروجی:
  // true

  // endsWith()
  // بررسی پایان رشته با یک مقدار مشخص:
  print(text.endsWith('Dart'));
  // خروجی:
  // true

  // contains()
  // اگر می‌خواهید وسط یک رشته را بررسی کنید، از:
  // contains
  // استفاده کنید:
  print(text.contains('love'));
  // خروجی:
  // true

  print(text.contains('Flutter'));
  // خروجی:
  // false

  // تمام این مثال‌ها بسیار خوب هستند،
  // اما چگونه می‌توانید بررسی کنید که یک شماره تلفن فقط شامل اعداد است
  // یا یک گذرواژه شامل حروف بزرگ و کوچک، اعداد و کاراکترهای ویژه است؟
  // این اتفاق توسط عبارات منظم می‌افتد
  // که در فایل:
  // regex.dart
  // آن‌ها را بررسی می‌کنیم.
}
